app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def show
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @comment = Comment.new(params[:comment])
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "email", "first_name", "last_name", "project_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"