app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def show
    match_projects = Project.where(:id => params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("code_base_url", "contact_email", "created_at", "description", "name", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"